/*
 * Copyright (C) 2025 TheProgxy <theprogxy@gmail.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <https://www.gnu.org/licenses/>.
 */

#ifndef _QCOW_PARSER_H_
#define _QCOW_PARSER_H_

#include "./utils.h"
#include "./zlib.h"
#include "./zstd.h" // TODO: Note that ZSTD is missing a compressor

/* -------------------------------------------------------------------------------------------------------- */
// -----------------
//  Constant Values
// -----------------
#define QCOW_HEADER_HEADER_START 8
#define DEFAULT_REF_CNT_BITS     16
#define SHARED_FIELDS_SIZE       52
#define QCOW_HEADER2_SIZE        72
#define QCOW_HEADER3_EXT         104 - QCOW_HEADER2_SIZE
#define L2_ENTRY_SIZE            8
#define L2_EXTENDED_ENTRY_SIZE   16

/* -------------------------------------------------------------------------------------------------------- */
// ------------------
//  Macros Functions
// ------------------

#define MASK_BITS_PRECEDING(bit_index) ((1ULL << (bit_index)) - 1)
#define GET_IMAGE_OFFSET(offset) (offset & MASK_BITS_INTERVAL(56, 9))
#define MASK_BITS_INTERVAL(a, b) (((char)(a) >= (char)(b)) ? (MASK_BITS_PRECEDING(a) & ~MASK_BITS_PRECEDING(b)) : 0)
#define FLOORING(dividend, divisor) (((dividend) - ((dividend) % (divisor))) / (divisor))
#define CEILING(dividend, divisor) (((dividend) - ((dividend) % (divisor))) / (divisor) + (((dividend) % (divisor)) > 0)) 
#define IS_CLUSTER_ALIGNED(cluster_offset, img_file_base, cluster_size) ((((cluster_offset) - (img_file_base)) % (cluster_size)) == 0)
#define IMG_OFFSET_INFO(img_offset) DEBUG_LOG("0x%lX: img_offset: 0x%llX, is_compressed_cluster: '%s'.\n", img_offset, img_offset & MASK_BITS_INTERVAL(56, 9), BOOL2STR(IS_COMPRESSED_CLUSTER(img_offset))) 

/* -------------------------------------------------------------------------------------------------------- */
// -------
//  Enums
// -------
typedef enum PACKED_STRUCT QCowErrors { 
    QCOW_NO_ERROR = 0, 
    QCOW_IO_ERROR, 
    QCOW_INVALID_OFFSET, 
    QCOW_UNALLOCATED_CLUSTER, 
    QCOW_DEFLATE_ERROR, 
    QCOW_INVALID_MAGIC, 
    QCOW_INVALID_VERSION, 
    QCOW_CLUSTER_BITS_TOO_SMALL, 
    QCOW_INVALID_COMPRESSION_TYPE, 
    QCOW_USE_OF_RESERVED_FIELD, 
    QCOW_UNALLOCATED_L1_TABLE, 
    QCOW_CORRUPTED_IMAGE, 
    QCOW_INVALID_REF_CNT_ORDER, 
    QCOW_MISSING_COMPRESSION_TYPE_FIELD, 
	QCOW_EMPTY_BACKING_FILE,	
    QCOW_INVALID_BACKING_FILE_OFFSET,
	QCOW_UNINITIALIZED_ERDF,
	QCOW_INVALID_SUBCLUSTER_BITMAP,
	QCOW_UNALIGNED_CLUSTER,
	QCOW_TODO 
} QCowErrors;

static const char* qcow_errors_str[] = { 
    "QCOW_NO_ERROR", 
    "QCOW_IO_ERROR", 
    "QCOW_INVALID_OFFSET", 
    "QCOW_UNALLOCATED_CLUSTER", 
    "QCOW_DEFLATE_ERROR", 
    "QCOW_INVALID_MAGIC", 
    "QCOW_INVALID_VERSION", 
    "QCOW_CLUSTER_BITS_TOO_SMALL", 
    "QCOW_INVALID_COMPRESSION_TYPE", 
    "QCOW_USE_OF_RESERVED_FIELD", 
    "QCOW_UNALLOCATED_L1_TABLE", 
    "QCOW_CORRUPTED_IMAGE", 
    "QCOW_INVALID_REF_CNT_ORDER", 
    "QCOW_MISSING_COMPRESSION_TYPE_FIELD", 
	"QCOW_EMPTY_BACKING_FILE",	
    "QCOW_INVALID_BACKING_FILE_OFFSET",
	"QCOW_UNINITIALIZED_ERDF",
	"QCOW_INVALID_SUBCLUSTER_BITMAP",
	"QCOW_UNALIGNED_CLUSTER",
    "QCOW_TODO" 
};

typedef enum PACKED_STRUCT QCowExtType {
    HEADER_EXT_END = 0,
    BACKING_FILE_NAME,
    FEATURE_NAME_TABLE,
    BITMAPS_EXTENSION,
    ENCRYPTION_HEADER,
    EXTERNAL_FILE_NAME,
    UNKNOWN_EXTENSION 
} QCowExtType;
static const char* qcow_ext_types_strs[] = { "HEADER_EXT_END", "BACKING_FILE_NAME", "FEATURE_NAME_TABLE", "BITMAPS_EXTENSION", "ENCRYPTION_HEADER", "EXTERNAL_FILE_NAME", "UNKNOWN_EXTENSION" };

/* deflate <https://www.ietf.org/rfc/rfc1951.txt> */
/* zstd <http://github.com/facebook/zstd> */
typedef enum PACKED_STRUCT CompressionType {DEFLATE = 0, ZSTD = 1} CompressionType;
static const char* compression_type_str[] = { "DEFLATE", "ZSTD" };

/* -------------------------------------------------------------------------------------------------------- */
// ---------
//  Structs
// ---------
typedef struct PACKED_STRUCT QCowHeader {
    char magic[4];                    // 0 - 3: QCOW magic string ("QFI\xfb")
    uint32_t version;                 // 4 - 7: Version number (valid values are 2 and 3)
    uint64_t backing_file_offset;     // 8 - 15: Offset to the backing file name
    uint32_t backing_file_name_size;  // 16 - 19: Length of the backing file name
    uint32_t cluster_bits;            // 20 - 23: Bits for addressing within a cluster
    uint64_t size;                    // 24 - 31: Virtual disk size in bytes
    uint32_t crypt_method;            // 32 - 35: 0 for no encryption, 1 for AES encryption
    uint32_t l1_size;                 // 36 - 39: Number of entries in the active L1 table
    uint64_t l1_table_offset;         // 40 - 47: Offset of the active L1 table
    uint64_t refcount_table_offset;   // 48 - 55: Offset of the refcount table
    uint32_t refcount_table_clusters; // 56 - 59: Clusters occupied by the refcount table
    uint32_t nb_snapshots;            // 60 - 63: Number of snapshots in the image
    uint64_t snapshots_offset;        // 64 - 71: Offset of the snapshot table
	uint64_t incompatible_features;   // Bytes 72 - 79
    uint64_t compatible_features;     // Bytes 80 - 87
    uint64_t autoclear_features;      // Bytes 88 - 95
    uint32_t refcount_order;          // Bytes 96 - 99
    uint32_t header_length;           // Bytes 100 - 103
} QCowHeader;

typedef struct PACKED_STRUCT QCowHeaderExtension {
	QCowExtType ext_type;
	uint32_t ext_length;
	uint8_t* data;
} QCowHeaderExtension;

typedef struct PACKED_STRUCT QCowMetadata {
    CompressionType compression_type;
    uint64_t backing_file_offset;
    uint32_t backing_file_name_size; 
	uint32_t cluster_bits;
    uint64_t size;
    uint32_t crypt_method; 
	uint32_t l1_size;
	uint64_t l1_table_offset;
	uint64_t refcount_table_offset;
	uint32_t refcount_table_clusters; 
	uint64_t cluster_size;
	uint32_t refcount_block_entries;
	uint32_t table_cluster_entries;
	uint32_t refcount_table_size;
	uint8_t refcount_bytes;
